# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceArray..::..Append Method
FaceArray Class See Also
---
Add the face to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Face item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Face _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Face^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..FaceThe face to be added.
# See Also
FaceArray Class
Autodesk.Revit.DB Namespace